# Postgres Setup

In [1]:
import requests
import zipfile
import io
import pandas as pd
from sqlalchemy import create_engine

In [2]:
import os

if os.path.exists('/.dockerenv'):
    print("✅ Running inside Docker")
else:
    print("❌ Not running inside Docker")

✅ Running inside Docker

## Download RAW DATA

In [3]:
url = "https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-10.csv.gz"

green_tip = pd.read_csv(url, compression='gzip')
display(green_tip.head())
display(green_tip.info())

/tmp/ipykernel_289/2342902890.py:5: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(url, compression='gzip')

In [25]:
url2 = "https://github.com/DataTalksClub/nyc-tlc-data/releases/download/misc/taxi_zone_lookup.csv"

zone = pd.read_csv(url2)
display(zone.head())
display(zone.info())

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LocationID    265 non-null    int64
 1   Borough       265 non-null    object
 2   Zone          264 non-null    object
 3   service_zone  263 non-null    object
dtypes: int64(1), object(3)
memory usage: 8.4+ KB

None

In [5]:
# Convert to appropriate data type
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

## Ingest Data into Postgres DB

In [6]:
engine = create_engine("postgresql://postgres:postgres@postgres:5432/ny_taxi")
engine.connect()

In [8]:
green_tip.to_sql(name='green_tripdata', con=engine, index=False)
zone.to_sql(name='zone', con=engine, index=False)

386

## Homework Q3 Answers

In [14]:
query = """
    SELECT
        CASE 
        WHEN trip_distance <= 1 THEN '< 1 mile'
        WHEN trip_distance > 1 AND trip_distance <= 3 THEN '1 ~ 3 miles'
        WHEN trip_distance > 3 AND trip_distance <= 7 THEN '3 ~ 7 miles'
        WHEN trip_distance > 7 AND trip_distance <= 10 THEN '7 ~ 10 miles'
        WHEN trip_distance >= 10 THEN '> 10 miles'
        END AS dist_tiers,
        COUNT(*) AS trips_count
    FROM green_tripdata
    WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_pickup_datetime < '2019-11-01' AND 
          lpep_dropoff_datetime >= '2019-10-01' AND lpep_dropoff_datetime < '2019-11-01'
    GROUP BY dist_tiers
"""

pd.read_sql(query, con=engine)

     dist_tiers  trips_count
0   1 ~ 3 miles       198924
1   3 ~ 7 miles       109603
2  7 ~ 10 miles        27678
3      < 1 mile       104802
4    > 10 miles        35189

## Homework Q4 Answers

In [21]:
query = """
    SELECT
        DATE(lpep_pickup_datetime) AS day,
        MAX(trip_distance) AS longest_trip
    FROM green_tripdata
    WHERE DATE(lpep_pickup_datetime) in ('2019-10-11', '2019-10-24', '2019-10-26', '2019-10-31')   
    GROUP BY DATE(lpep_pickup_datetime)
    ORDER BY longest_trip DESC
    LIMIT 1
"""

pd.read_sql(query, con=engine)

          day  longest_trip
0  2019-10-31        515.89

## Homework Q5 Answers

In [33]:
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1.0,112,196,1.0,5.88,18.0,0.50,0.5,0.00,0.0,NaN,0.3,19.30,2.0,1.0,0.0
1,1.0,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1.0,43,263,1.0,0.80,5.0,3.25,0.5,0.00,0.0,NaN,0.3,9.05,2.0,1.0,0.0
2,1.0,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1.0,255,228,2.0,7.50,21.5,0.50,0.5,0.00,0.0,NaN,0.3,22.80,2.0,1.0,0.0
3,1.0,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1.0,181,181,1.0,0.90,5.5,0.50,0.5,0.00,0.0,NaN,0.3,6.80,2.0,1.0,0.0
4,2.0,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1.0,97,188,1.0,2.52,10.0,0.50,0.5,2.26,0.0,NaN,0.3,13.56,1.0,1.0,0.0

In [28]:
zone.tail()

     LocationID    Borough                Zone service_zone
260         261  Manhattan  World Trade Center  Yellow Zone
261         262  Manhattan      Yorkville East  Yellow Zone
262         263  Manhattan      Yorkville West  Yellow Zone
263         264    Unknown                  NV          NaN
264         265    Unknown                 NaN          NaN

In [57]:
query = """
    SELECT
        t2."Zone", 
        sum(T1.total_amount) as total_amount_sum
    FROM green_tripdata t1
    LEFT JOIN zone t2 ON t1."PULocationID" = t2."LocationID"
    WHERE DATE(t1.lpep_pickup_datetime) = '2019-10-18'
    GROUP BY t2."Zone"
    HAVING SUM(t1.total_amount) > 13000
    ORDER BY total_amount_sum DESC
    LIMIT 3
"""

pd.read_sql(query, con=engine)

                  Zone  total_amount_sum
0    East Harlem North          18686.68
1    East Harlem South          16797.26
2  Morningside Heights          13029.79

## Homework Q6 Answers

In [66]:
query = """
    SELECT
        t3."Zone" As pick_up_zone,
        t2."Zone" As drop_off_zone, 
        MAX(T1.tip_amount) as tip_amount
    FROM green_tripdata t1
    LEFT JOIN zone t2 ON t1."DOLocationID" = t2."LocationID"
    INNER JOIN zone t3 ON t1."PULocationID" = t3."LocationID"
    WHERE DATE(t1.lpep_pickup_datetime) >= '2019-10-01' AND DATE(t1.lpep_pickup_datetime) <= '2019-10-30'
        AND t3."Zone" = 'East Harlem North'
    GROUP BY t3."Zone", t2."Zone"
    ORDER BY tip_amount DESC
    LIMIT 1;
"""

pd.read_sql(query, con=engine)

        pick_up_zone drop_off_zone  tip_amount
0  East Harlem North   JFK Airport        87.3